Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--re3gistry_overview.tmx
Source language: en
Languages: ja

source: The Re3gistry 2 is a reusable open source solution for managing and sharing "reference codes". Initially developed as a central component of the EU's :doc:`INSPIRE <inspire_overview>` infrastructure, it provides a consistent central access point where labels and descriptions for reference codes can be easily browsed by humans and retrieved by machines. Reference codes are exchanged between applications to uniquely reference some ‘thing’. They can be used to define sets of permissible values for a data field or to provide a reference or context for the data being exchanged. Examples are enumerations, controlled vocabularies, taxonomies, thesauri or, simply, ‘lists of things’. The Re3gistry 2 supports organisations in managing and updating reference codes in a consistent way. The Re3gistry software version numbers comply with the Semantic Versioning Specification 2.0.0.
ja: Re3gistry 2は、「リファレンスコード」を管理および共有するための再利用可能なオープンソースソリューションです。当初はEUの:doc:`INSPIRE<inspire_overview>`インフラストラクチャの中心的なコンポーネントとして開発されたもので、リファレンスコードのラベルと説明を人間が簡単にブラウズし、マシンが検索できる一貫した中央アクセスポイントを提供します。リファレンスコードは、何らかの「もの」を一意に参照するためにアプリケーション間で交換されます。これらを使用して、データフィールドの許容値のセットを定義したり、交換されるデータの参照またはコンテキストを提供したりできます。例としては、列挙、統制された語彙、分類法、シソーラス、あるいは単に「ものの一覧」があります。Re3gistry 2は、組織が一貫した方法で参照コードを管理し更新することを支援しています。Re3gistryソフトウェアのバージョン番号は、セマンティック・バージョン付与標準2.0.0に準拠しています。

source: Core Features
ja: 主要機能

source: User-friendly editing interface to easily add, edit and manage the registers and reference codes
ja: 登録者とリファレンスコードの追加、編集、管理を容易にする使いやすい編集インタフェース

source: Management of the full lifecycle of the reference codes (based on the ISO 19135 Standard)
ja: (ISO19135規格に基づく)リファレンスコードのライフサイクル全体の管理

source: Highly flexible and customisable data models
ja: 柔軟性とカスタマイズ性に優れたデータ・モデル

source: Multi-lingual content support
ja: 多言語コンテンツのサポート

source: Support for versioning
ja: バージョン管理のサポート

source: RESTful API with content negotiation (including OpenAPI 3 descriptor)
ja: コンテンツネゴシエーションを持つ(OpenAPI 3記述子を含む)RESTful API

source: Free-text search
ja: 自由文検索

source: Supported formats: HTML, ISO 19135 XML, JSON
ja: サポートされるフォーマット:HTML、ISO19135XML、JSON

source: Service formats can be easily added or customised (default formats: JSON and ISO 19135 XML)
ja: サービスフォーマットは簡単に追加またはカスタマイズできる(デフォルトフォーマット:JSONとISO19135XML)

source: Multiple authentication options
ja: 複数の認証オプション

source: Externally governed items referenced through URIs
ja: URIを通じて参照される外部的に管理される項目

source: INSPIRE register federation format support (option to automatically create the RoR format)
ja: INSPIREレジスタフェデレーションフォーマットのサポート(RoRフォーマットを自動的に作成するオプション)

source: Web-app to access the reference codes in a human readable way.
ja: 人間が読める方法で参照コードにアクセスするためのWebアプリケーション。

source: Details
ja: 詳細

source: **Website:** https://github.com/ec-jrc/re3gistry
ja: **ウェブサイト:**https://github.com/ec-jrc/re3gistry

source: **Licence:** EUPL
ja: **ライセンス:**EUPL

source: **Software Version:** |version-re3gistry|
ja: **ソフトウェアバージョン:**version-re3gistry

source: **Supported Platforms:** Windows, Linux
ja: **対応プラットフォーム:** Windows, Linux

source: **API Interfaces:** Java
ja: **API インターフェイス:** Java

source: **Support:** https://github.com/ec-jrc/re3gistry
ja: **サポート:**https://github.com/ec-jrc/re3gistry

source: **User manual:** https://github.com/ec-jrc/re3gistry/blob/master/documentation/user-manual.md
ja: **ユーザーマニュアル:**https://github.com/ec-jrc/re3gistry/blob/master/documentation/user-manual.md

source: **Administrator manual:** https://github.com/ec-jrc/re3gistry/blob/master/documentation/administrator-manual.md
ja: **管理者マニュアル:**https://github.com/ec-jrc/re3gistry/blob/master/documentation/administrator-manual.md

source: **Developer manual:** https://github.com/ec-jrc/re3gistry/blob/master/documentation/developer-manual.md
ja: **開発者マニュアル:**https://github.com/ec-jrc/re3gistry/blob/master/documentation/developer-manual.md

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/re3gistry_quickstart>`
ja: :doc:`クイックスタートドキュメント<./quickstart/re3gistry_quickstart>`
